{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.17.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": false, "is_legacy_optimizer": false, "learning_rate": {"module": "keras.optimizers.schedules", "class_name": "ExponentialDecay", "config": {"initial_learning_rate": 0.001, "decay_steps": 1000, "decay_rate": 0.9, "staircase": false, "name": null}, "registered_name": null}, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of197.bin", "group1-shard2of197.bin", "group1-shard3of197.bin", "group1-shard4of197.bin", "group1-shard5of197.bin", "group1-shard6of197.bin", "group1-shard7of197.bin", "group1-shard8of197.bin", "group1-shard9of197.bin", "group1-shard10of197.bin", "group1-shard11of197.bin", "group1-shard12of197.bin", "group1-shard13of197.bin", "group1-shard14of197.bin", "group1-shard15of197.bin", "group1-shard16of197.bin", "group1-shard17of197.bin", "group1-shard18of197.bin", "group1-shard19of197.bin", "group1-shard20of197.bin", "group1-shard21of197.bin", "group1-shard22of197.bin", "group1-shard23of197.bin", "group1-shard24of197.bin", "group1-shard25of197.bin", "group1-shard26of197.bin", "group1-shard27of197.bin", "group1-shard28of197.bin", "group1-shard29of197.bin", "group1-shard30of197.bin", "group1-shard31of197.bin", "group1-shard32of197.bin", "group1-shard33of197.bin", "group1-shard34of197.bin", "group1-shard35of197.bin", "group1-shard36of197.bin", "group1-shard37of197.bin", "group1-shard38of197.bin", "group1-shard39of197.bin", "group1-shard40of197.bin", "group1-shard41of197.bin", "group1-shard42of197.bin", "group1-shard43of197.bin", "group1-shard44of197.bin", "group1-shard45of197.bin", "group1-shard46of197.bin", "group1-shard47of197.bin", "group1-shard48of197.bin", "group1-shard49of197.bin", "group1-shard50of197.bin", "group1-shard51of197.bin", "group1-shard52of197.bin", "group1-shard53of197.bin", "group1-shard54of197.bin", "group1-shard55of197.bin", "group1-shard56of197.bin", "group1-shard57of197.bin", "group1-shard58of197.bin", "group1-shard59of197.bin", "group1-shard60of197.bin", "group1-shard61of197.bin", "group1-shard62of197.bin", "group1-shard63of197.bin", "group1-shard64of197.bin", "group1-shard65of197.bin", "group1-shard66of197.bin", "group1-shard67of197.bin", "group1-shard68of197.bin", "group1-shard69of197.bin", "group1-shard70of197.bin", "group1-shard71of197.bin", "group1-shard72of197.bin", "group1-shard73of197.bin", "group1-shard74of197.bin", "group1-shard75of197.bin", "group1-shard76of197.bin", "group1-shard77of197.bin", "group1-shard78of197.bin", "group1-shard79of197.bin", "group1-shard80of197.bin", "group1-shard81of197.bin", "group1-shard82of197.bin", "group1-shard83of197.bin", "group1-shard84of197.bin", "group1-shard85of197.bin", "group1-shard86of197.bin", "group1-shard87of197.bin", "group1-shard88of197.bin", "group1-shard89of197.bin", "group1-shard90of197.bin", "group1-shard91of197.bin", "group1-shard92of197.bin", "group1-shard93of197.bin", "group1-shard94of197.bin", "group1-shard95of197.bin", "group1-shard96of197.bin", "group1-shard97of197.bin", "group1-shard98of197.bin", "group1-shard99of197.bin", "group1-shard100of197.bin", "group1-shard101of197.bin", "group1-shard102of197.bin", "group1-shard103of197.bin", "group1-shard104of197.bin", "group1-shard105of197.bin", "group1-shard106of197.bin", "group1-shard107of197.bin", "group1-shard108of197.bin", "group1-shard109of197.bin", "group1-shard110of197.bin", "group1-shard111of197.bin", "group1-shard112of197.bin", "group1-shard113of197.bin", "group1-shard114of197.bin", "group1-shard115of197.bin", "group1-shard116of197.bin", "group1-shard117of197.bin", "group1-shard118of197.bin", "group1-shard119of197.bin", "group1-shard120of197.bin", "group1-shard121of197.bin", "group1-shard122of197.bin", "group1-shard123of197.bin", "group1-shard124of197.bin", "group1-shard125of197.bin", "group1-shard126of197.bin", "group1-shard127of197.bin", "group1-shard128of197.bin", "group1-shard129of197.bin", "group1-shard130of197.bin", "group1-shard131of197.bin", "group1-shard132of197.bin", "group1-shard133of197.bin", "group1-shard134of197.bin", "group1-shard135of197.bin", "group1-shard136of197.bin", "group1-shard137of197.bin", "group1-shard138of197.bin", "group1-shard139of197.bin", "group1-shard140of197.bin", "group1-shard141of197.bin", "group1-shard142of197.bin", "group1-shard143of197.bin", "group1-shard144of197.bin", "group1-shard145of197.bin", "group1-shard146of197.bin", "group1-shard147of197.bin", "group1-shard148of197.bin", "group1-shard149of197.bin", "group1-shard150of197.bin", "group1-shard151of197.bin", "group1-shard152of197.bin", "group1-shard153of197.bin", "group1-shard154of197.bin", "group1-shard155of197.bin", "group1-shard156of197.bin", "group1-shard157of197.bin", "group1-shard158of197.bin", "group1-shard159of197.bin", "group1-shard160of197.bin", "group1-shard161of197.bin", "group1-shard162of197.bin", "group1-shard163of197.bin", "group1-shard164of197.bin", "group1-shard165of197.bin", "group1-shard166of197.bin", "group1-shard167of197.bin", "group1-shard168of197.bin", "group1-shard169of197.bin", "group1-shard170of197.bin", "group1-shard171of197.bin", "group1-shard172of197.bin", "group1-shard173of197.bin", "group1-shard174of197.bin", "group1-shard175of197.bin", "group1-shard176of197.bin", "group1-shard177of197.bin", "group1-shard178of197.bin", "group1-shard179of197.bin", "group1-shard180of197.bin", "group1-shard181of197.bin", "group1-shard182of197.bin", "group1-shard183of197.bin", "group1-shard184of197.bin", "group1-shard185of197.bin", "group1-shard186of197.bin", "group1-shard187of197.bin", "group1-shard188of197.bin", "group1-shard189of197.bin", "group1-shard190of197.bin", "group1-shard191of197.bin", "group1-shard192of197.bin", "group1-shard193of197.bin", "group1-shard194of197.bin", "group1-shard195of197.bin", "group1-shard196of197.bin", "group1-shard197of197.bin"], "weights": [{"name": "conv2d/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [256], "dtype": "float32"}, {"name": "dense/kernel", "shape": [200704, 1024], "dtype": "float32"}, {"name": "dense/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [1024, 10], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [10], "dtype": "float32"}]}]}